---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerIterator.Dispose
source: html/787bb64b-245f-516d-6741-fe6a38351d8c.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerIterator.Dispose Method

Releases all resources used by the RebarContainerIterator

## Syntax (C#)
```csharp
public void Dispose()
```